# Вариант 1

# p = int(input("Введите число, обозначающее, какое количество элементов последовательности необходимо ввести: "))

# counter = 0

# for i in range(p):
#  n = int(input("Введите число: "))
#  if (n % 8 == 1) and (4095 < n < 32768):
#   counter += 1
#  print(counter)
 

# Пятизначные числа в восьмеричной системе: от 10000 до 77777
# В десятеричной это соответствует 4096 и 32768
# Если число в восьмеричной системе заканчивается на 1, то при делении на 8 (основание системы) остаток как раз будет равен 1. Например: число 17 в восьмеричной системе это 21, 17 % 8 = 1. Число 33 в восьмеричной это 41, 33 % 8 = 1.


